archmangler/stm32f411dev/pushbutton_gpio_input_bsrr_working/Src/main.c
/* version 1.0.0
 * Core Drive code for the electromechanical  features of the "METRON-5" maze-based toy.
 * Copyright Engeneon Internet Products Pty. Ltd 2004
 * Author: Traiano G. Welcome
 *
 * */

#include "stm32f411xe.h"

#define GPIOAEN (1U<<0)
#define GPIOCEN	(1U<<2)

void my_delay_longest(void);
void my_delay_longer(void);
void my_delay_long(void);
void my_delay_short(void);

void loop_test_one_porta(void);
void loop_test_two_porta(void);
void loop_test_three_porta(void);
void loop_test_four_porta(void);
void music_routine_001(void);
void my_delay_shorter(void);
void my_delay_shortest(void);
void my_delay_medium(void);


void inc_fwd_a0(void);
void inc_rev_a1(void);

void loop_test_porta_clear(void);

int main(void)
{

	RCC->AHB1ENR |= GPIOAEN;
	RCC->AHB1ENR |= GPIOCEN;

	/*set pin A0 as an output pin*/
	GPIOA->MODER |= (1U<<0);
	GPIOA->MODER &=~(1U<<1);

	/*set pin A1 as an output pin*/
	GPIOA->MODER |= (1U<<2);
	GPIOA->MODER &=~(1U<<3);

	/*set pin A2 as an output pin*/
	GPIOA->MODER |= (1U<<4);
	GPIOA->MODER &=~(1U<<5);

	/*set pin A3 as an output pin*/
	GPIOA->MODER |= (1U<<6);
	GPIOA->MODER &=~(1U<<7);

	/*set pin A4 as an output pin*/
	GPIOA->MODER |= (1U<<8);
	GPIOA->MODER &=~(1U<<9);

	//set pin A5 as an output pin
	GPIOA->MODER |= (1U<<10);
	GPIOA->MODER &=~(1U<<11);

	//set pin A6 as an output pin
	GPIOA->MODER |= (1U<<12);
	GPIOA->MODER &=~(1U<<13);

	//set pin A7 as an output pin
	GPIOA->MODER |= (1U<<14);
	GPIOA->MODER &=~(1U<<15);

	//set pin A8 as an output pin
	GPIOA->MODER |= (1U<<16);
	GPIOA->MODER &=~(1U<<17);

	//set pin A9 as an output pin
	GPIOA->MODER |= (1U<<18);
	GPIOA->MODER &=~(1U<<19);

	//set pin A10 as an output pin
	GPIOA->MODER |= (1U<<20);
	GPIOA->MODER &=~(1U<<21);

	//set pin A11 as an output pin
	GPIOA->MODER |= (1U<<22);
	GPIOA->MODER &=~(1U<<23);

	//set pin A12 as an output pin
	GPIOA->MODER |= (1U<<24);
	GPIOA->MODER &=~(1U<<25);

	//for some reason  the programmer goes crazy if we use these pins
	//figure it out later
/*
	//set pin A13 as an output pin
	GPIOA->MODER |= (1U<<26);
	GPIOA->MODER &=~(1U<<27);

	//set pin A14 as an output pin
	GPIOA->MODER |= (1U<<28);
	GPIOA->MODER &=~(1U<<29);

	//set pin A15 as an output pin
	GPIOA->MODER |= (1U<<30);
	GPIOA->MODER &=~(1U<<31);
*/

	/*Set PINC13 as input pin*/
	GPIOC->MODER &=~(1U<<26);
	GPIOC->MODER &=~(1U<<27);

	/*Set PINC12 as input pin*/
	GPIOC->MODER &=~(1U<<24);
	GPIOC->MODER &=~(1U<<25);

	/*Set PINC11 as input pin*/
	GPIOC->MODER &=~(1U<<22);
	GPIOC->MODER &=~(1U<<23);

	/*Set PINC10 as input pin*/
	GPIOC->MODER &=~(1U<<20);
	GPIOC->MODER &=~(1U<<21);

	/*END CONDITION SWITCH 1: Set PINC09 as input pin*/
	//GPIOC->MODER &=~(1U<<18);
	//GPIOC->MODER &=~(1U<<19);

	/*END CONDITION SWITCH 2: Set PINC08 as input pin*/
	//GPIOC->MODER &=~(1U<<16);
	//GPIOC->MODER &=~(1U<<17);


    while(1) {

        if (GPIOC->IDR &  0b0010000000000000) { //0x 2 0 0 0 -> 0x 0010 0000 00000 0000
            loop_test_porta_clear();
        } else {

        	loop_test_one_porta();
        	music_routine_001();
        	my_delay_longer(); //relax a while to cool the batteries off
        }

        if (GPIOC->IDR &  0b0001000000000000) {
            loop_test_porta_clear();
        } else {
        	loop_test_two_porta();
        	music_routine_001();
        	my_delay_longer(); //relax a while to cool the batteries off
        }

        if (GPIOC->IDR &  0b0000100000000000) {
            loop_test_porta_clear();
        } else {
        	loop_test_three_porta();
        	music_routine_001();
        	my_delay_longer(); //relax a while to cool the batteries off
        }

        if (GPIOC->IDR &  0b0000010000000000) {
            loop_test_porta_clear();
        } else {
        	loop_test_four_porta();
        	music_routine_001();
        	my_delay_longer(); //relax a while to cool the batteries off

        }

    	/*    	//PINC-9
        if (GPIOC->IDR &  0b0000001000000000) {
            loop_test_porta_clear();
        } else {
        	inc_rev_a1();
        }

        //PINC-8
        if (GPIOC->IDR &  0b0000000100000000) {
            loop_test_porta_clear();
        } else {
        	inc_fwd_a0();
        }
        */

    }

}


void loop_test_one_porta(void) {
/*
	//A15
    GPIOA->BSRR = 0b00000000000000001000000000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A14
    GPIOA->BSRR = 0b00000000000000000100000000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A13
    GPIOA->BSRR = 0b00000000000000000010000000000000;
    my_delay_long();
    loop_test_porta_clear();
*/
    //Drive the linear motor which needs both relays driven from independent power sources.
    //A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    //A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_longest();
    loop_test_porta_clear();

	//A12
    GPIOA->BSRR = 0b00000000000000000001000000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A9
    GPIOA->BSRR = 0b00000000000000000000001000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A8
    GPIOA->BSRR = 0b00000000000000000000000100000000;
    my_delay_long();
    loop_test_porta_clear();

	//A7
    GPIOA->BSRR = 0b00000000000000000000000010000000;
    my_delay_long();
    loop_test_porta_clear();

    //A6
    GPIOA->BSRR = 0b00000000000000000000000001000000;
    my_delay_long();
    loop_test_porta_clear();

    //A5
    GPIOA->BSRR = 0b00000000000000000000000000100000;
    my_delay_long();
    loop_test_porta_clear();

    //A4
    GPIOA->BSRR = 0b00000000000000000000000000010000;
    my_delay_long();
    loop_test_porta_clear();

    //A3
    GPIOA->BSRR = 0b00000000000000000000000000001000;
    my_delay_long();
    loop_test_porta_clear();

    //A2
    GPIOA->BSRR = 0b00000000000000000000000000000100;
    my_delay_long();
    loop_test_porta_clear();

    //A1
    GPIOA->BSRR = 0b00000000000000000000000000000010;
    my_delay_long();
    loop_test_porta_clear();

    //A0
    GPIOA->BSRR = 0b00000000000000000000000000000001;
    my_delay_long();
    loop_test_porta_clear();

}

void loop_test_two_porta(void) {

    //Drive the linear motor which needs both relays driven from independent power sources.
    //A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    //A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_longest();
    loop_test_porta_clear();

	//A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A9
    GPIOA->BSRR = 0b00000000000000000000001000000000;
    my_delay_long();
    loop_test_porta_clear();

	//A7
    GPIOA->BSRR = 0b00000000000000000000000010000000;
    my_delay_long();
    loop_test_porta_clear();


	//A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    my_delay_long();
    loop_test_porta_clear();

   //A5
    GPIOA->BSRR = 0b00000000000000000000000000100000;
    my_delay_long();
    loop_test_porta_clear();

    //A3
    GPIOA->BSRR = 0b00000000000000000000000000001000;
    my_delay_long();
    loop_test_porta_clear();

	//A12
    GPIOA->BSRR = 0b00000000000000000001000000000000;
    my_delay_long();
    loop_test_porta_clear();

    //A2
    GPIOA->BSRR = 0b00000000000000000000000000000100;
    my_delay_long();
    loop_test_porta_clear();

    //A4
    GPIOA->BSRR = 0b00000000000000000000000000010000;
    my_delay_long();
    loop_test_porta_clear();

    //A0
    GPIOA->BSRR = 0b00000000000000000000000000000001;
    my_delay_long();
    loop_test_porta_clear();

    //A1
    GPIOA->BSRR = 0b00000000000000000000000000000010;
    my_delay_long();
    loop_test_porta_clear();


    //Drive the stepper motor which needs both relays driven from independent power sources.
    //A6
    GPIOA->BSRR = 0b00000000000000000000000001000000;
    //A8
    GPIOA->BSRR = 0b00000000000000000000000100000000;
    my_delay_longer();
    loop_test_porta_clear();


}


void loop_test_three_porta(void) {

    //Drive the linear motor which needs both relays driven from independent power sources.
    //A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    //A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_longest();
    loop_test_porta_clear();

	//A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_short();
    loop_test_porta_clear();

	//A9
    GPIOA->BSRR = 0b00000000000000000000001000000000;
    my_delay_short();
    loop_test_porta_clear();

	//A7
    GPIOA->BSRR = 0b00000000000000000000000010000000;
    my_delay_short();
    loop_test_porta_clear();

    //A6
    GPIOA->BSRR = 0b00000000000000000000000001000000;
    my_delay_short();
    loop_test_porta_clear();

	//A8
    GPIOA->BSRR = 0b00000000000000000000000100000000;
    my_delay_short();
    loop_test_porta_clear();

	//A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    my_delay_short();
    loop_test_porta_clear();

   //A5
    GPIOA->BSRR = 0b00000000000000000000000000100000;
    my_delay_short();
    loop_test_porta_clear();

    //A3
    GPIOA->BSRR = 0b00000000000000000000000000001000;
    my_delay_short();
    loop_test_porta_clear();

	//A12
    GPIOA->BSRR = 0b00000000000000000001000000000000;
    my_delay_short();
    loop_test_porta_clear();

    //A2
    GPIOA->BSRR = 0b00000000000000000000000000000100;
    my_delay_short();
    loop_test_porta_clear();

    //A4
    GPIOA->BSRR = 0b00000000000000000000000000010000;
    my_delay_short();
    loop_test_porta_clear();

    //A0
    GPIOA->BSRR = 0b00000000000000000000000000000001;
    my_delay_short();
    loop_test_porta_clear();

    //A1
    GPIOA->BSRR = 0b00000000000000000000000000000010;
    my_delay_short();
    loop_test_porta_clear();


}


void loop_test_four_porta(void) {

    //Drive the linear motor which needs both relays driven from independent power sources.
    //A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    //A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_longest();
    loop_test_porta_clear();


    //A3
    GPIOA->BSRR = 0b00000000000000000000000000001000;
    my_delay_short();
    loop_test_porta_clear();

	//A7
    GPIOA->BSRR = 0b00000000000000000000000010000000;
    my_delay_short();
    loop_test_porta_clear();

    //A6
    GPIOA->BSRR = 0b00000000000000000000000001000000;
    my_delay_short();
    loop_test_porta_clear();

	//A8
    GPIOA->BSRR = 0b00000000000000000000000100000000;
    my_delay_short();
    loop_test_porta_clear();

	//A9
    GPIOA->BSRR = 0b00000000000000000000001000000000;
    my_delay_short();
    loop_test_porta_clear();

	//A11
    GPIOA->BSRR = 0b00000000000000000000100000000000;
    my_delay_short();
    loop_test_porta_clear();

	//A10
    GPIOA->BSRR = 0b00000000000000000000010000000000;
    my_delay_short();
    loop_test_porta_clear();

    //A0
    GPIOA->BSRR = 0b00000000000000000000000000000001;
    my_delay_short();
    loop_test_porta_clear();

	//A12
    GPIOA->BSRR = 0b00000000000000000001000000000000;
    my_delay_short();
    loop_test_porta_clear();

    //A2
    GPIOA->BSRR = 0b00000000000000000000000000000100;
    my_delay_short();
    loop_test_porta_clear();

    //A4
    GPIOA->BSRR = 0b00000000000000000000000000010000;
    my_delay_short();
    loop_test_porta_clear();

    //A1
    GPIOA->BSRR = 0b00000000000000000000000000000010;
    my_delay_short();
    loop_test_porta_clear();

    //A5
    GPIOA->BSRR = 0b00000000000000000000000000100000;
    my_delay_short();
    loop_test_porta_clear();



}

void music_routine_001(void) {
    //A0
    //GPIOA->BSRR = 0b00000000000000000000000000000001;
    //A6
	for (int i=0;i<10;i++) {
		GPIOA->BSRR = 0b00000000000000000000000000100000;
		my_delay_short();
		loop_test_porta_clear();

		GPIOA->BSRR = 0b00000000000000000000000000100000;
		my_delay_shorter();
		loop_test_porta_clear();
		my_delay_shorter();

		GPIOA->BSRR = 0b00000000000000000000000000100000;
		my_delay_medium();
		loop_test_porta_clear();
		my_delay_short();
		for (int i=0;i<10;i++) {
			GPIOA->BSRR = 0b00000000000000000000000000100000;
			my_delay_shorter();
			loop_test_porta_clear();
			my_delay_shortest();
		}
	}

}

//incremental reverse to a motor drive
void inc_rev_a1(void) {
    //A1
    GPIOA->BSRR = 0b00000000000000000000000000000010;
    my_delay_short();
    loop_test_porta_clear();
}

//incremental forward to a motor drive
void inc_fwd_a0(void) {
    //A0
    GPIOA->BSRR = 0b00000000000000000000000000000001;
    my_delay_short();
    loop_test_porta_clear();
}

void loop_test_porta_clear(void) {
	GPIOA->BSRR = 0b00011111111111110000000000000000;
    my_delay_short();
}

void my_delay_longest(void) {
    for(int i=0;i<100000000;i++){
		//do nothing
	}
}

void my_delay_longer(void) {
    for(int i=0;i<50000000;i++){
		//do nothing
	}
}

void my_delay_long(void) {
    for(int i=0;i<1000000;i++){
		//do nothing
	}
}

void my_delay_medium(void) {
    for(int i=0;i<500000;i++){
		//do nothing
	}
}

void my_delay_short(void) {
    for(int i=0;i<100000;i++){
		//do nothing
	}
}

void my_delay_shorter(void) {
    for(int i=0;i<10000;i++){
		//do nothing
	}
}

void my_delay_shortest(void) {
    for(int i=0;i<1000;i++){
		//do nothing
	}
}
